#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <time.h>
#include "Header.h"
//------------------------------------------
#define N 5000 //Все N меняем на то что стоит после(#define N 10 все N меняет на 10)
#define SWAP(a,b) {int t; t=(a); (a)=(b); (b)=t;} //круглые скобки это правило хорошего тона
#define MIN(a,b) ((a)<(b)?(a):(b))
//------------------------------------------
void BubbleSort(int *m, size_t n) // Вместо size_t можно и int
	{
		size_t i,j;

		for(i=0;i<n;i++)
			for(j=1;j<n;j++)
				if(m[j-1]>m[j]) SWAP(m[j-1],m[j]);
	}

//------------------------------------------
void Merge(int *m1, size_t n1, int *m2, size_t n2, int *r) //Функция для слияния двух отсортированных массиов. Хотим из двух отсортированных массивов сделать один отсортированный
	{
		while(n1>0&&n2>0)
			{	
					if(*m1<*m2)
					{
						*(r++)=*(m1++);
						n1--;
					} 
				else 
					{
						*(r++)=*(m2++);
						n2--;	
					}
			}

		while(n1>0)
			{
				*(r++)=*(m1++);
				n1--;
			}

		while(n2>0)
			{
				*(r++)=*(m2++);
				n2--;
			}			
	}
//-----------------------------------------
void Sort1(int *m, size_t n, int *t) //Сортировка слиянием с рекурсией. t-временный массив
	{                                 //Берем массив. Если он длины <=1 то ничего делать не надо.Выходим.
					                   //В другом случае бьем его на две половины и вызываем ту же самую функцию. Эта функция отсортирует эти половинки.И мы их сливаем с помощью слияния.
		int n1,n2;  //Длины кусков массивов                
		if(n<=1) return;
		n1=n/2;
		n2=n-n1;
		Sort1(m,n1,t);
		Sort1(m+n1, n2, t+n1);
		Merge(m,n1,m+n1,n2,t); //сливаем в массив t
		memcpy(m,t,n*sizeof(*m)); //Перебрасываем из t в m.
	}
//------------------------------------------- OpenMP
void Sort1OMP(int *m, size_t n, int *t)
	{                                 
			int n1,n2;                
		if(n<=1) return;                                                                                      
		n1=n/2;
		n2=n-n1;
		#pragma omp parallel sections //говорим что дальше пойдут параллельные секции в блоке из {}.
	    	{
	    		#pragma omp section //Указываем секции
				{Sort1(m,n1,t);}          //Sort1 здесь не пересекаются, значит можем распаралелить.
				#pragma omp section       // В данном случае используем 2 потока.
				{Sort1(m+n1, n2, t+n1);}
			}
		Merge(m,n1,m+n1,n2,t); 
		memcpy(m,t,n*sizeof(*m)); 
	}
//-------------------------------------------
void Sort2(int *m, size_t n, int *t)
	{
		size_t k,k2,i;//в конце будет пара кусков один длины k а другой может быть короче.

		for(k=1;k<n;k*=2)
			{
				for(i=0;i+k<n;i+=2*k)//Второй кусок начинается с места i+k. 
					{
						k2=MIN(k,n-(i+k));//если второй кусок короче. k2-длина второго куска (n-(i+k)-Длинна куска от позиции i+k до конца)
						Merge(m+i,k,m+i+k,k2,t+i); //Получаем кусок длины k+k2
						memcpy(m+i,t+i,(k+k2)*sizeof(*m));
                    }

			}
	}
//----------------------------------------OpenMP
void Sort2OMP(int *m, size_t n, int *t)
	{
		size_t k,k2;//Переменная k2 общая, и с ней нельзя распаралеливать.

		for(k=1;k<n;k*=2)
			{
				int nn=n-k,i;// Чтоб компилятор сЪел.
#pragma omp parallel for private(k2)//Распаралеливание циклов.//Делаем k2 приватной, чтоб в каждом потоке она была своя.
				for(i=0;i<nn;i+=2*k)//Второй кусок начинается с места i+k. 
					{
						k2=MIN(k,n-(i+k));//если второй кусок короче. k2-длина второго куска (n-(i+k)-Длинна куска от позиции i+k до конца)
						Merge(m+i,k,m+i+k,k2,t+i); //Получаем кусок длины k+k2
						memcpy(m+i,t+i,(k+k2)*sizeof(*m));
                    }

			}
	}
//-------------------------------------------
void QSort1(int *m, size_t n)//Разбиваем на QSort 1 и QSort1_ чтоб удобнее вызывать 
	{
		QSort1_(m,0,n-1);
	}

void QSort1_(int *m,size_t p,size_t q)//Работаем от элементов p до q.
	{
		size_t i,j;  //M=m[j];(Взяли j как псевдомедиану) [p,i-1]<=M<=[j,q]
		if (p>=q) return;
		i=p;
		j=q;

		while(1)
			{
				while(m[i]<m[j]) i++;//M=m[j]; [p,i-1]<=M<=[j,q]
				SWAP(m[i],m[j]);     //M=m[i]; [p,i]<=M<=[j,q] теперь псевдомедиана из j элемента перенеслась в i.
				j--;                 //M=m[i]; [p,i]<=M<=[j+1,q]. j-- гарантирует что j+1 будет в гранницах нашего массива.
				                     // Если j никуда не сдвинулась, то в первый блок if мы не попадем.
				if(i>=j)// (1)Если Встретились (Можем либо вастретиться, либо перескачить)
					{
						//i==j:   //M=m[j]; [p,j]<=M<=[j+1,q]
						//i=j=1:  //M=m[j]; [p,j+1]<=M<=[j+1,q] => [p,j]<=M<=[j+1,q]
						QSort1_(m,p,j);
						QSort1_(m,j+1,q);
						return;
					}

				while(m[i]<m[j]) j--; //M=m[i]; [p,i]<=M<=[j+1,q]
				SWAP(m[i],m[j]);      //M=m[j]; [p,i]<=M<=[j,q]
				i++;                  //M=m[j]; [p,i-1]<=M<=[j,q] Совпадает с тем, что было в начале.//i++ гарантирует что i-1 будет в гранницах нашего массива.

				if(i>=j) //(2)
					{   //Два случая:
						//i==j:       //M=m[j]; [p,j-1]<=M<=[j,q]  =>  [p,j]<=M<=[j,q]
						//i=j+1:      //M=m[j]; [p,j]<=M<=[j,q]
						QSort1_(m,p,j);
						QSort1_(m,j+1,q);
						return;
					}
			}

	}
//-------------------------------------------
void QSort2(int *m, size_t n)
	{
		QSort2_(m,0,n-1);
	}

void QSort2_(int *m,size_t p,size_t q)
	{
		size_t i,j;
		int M;
		if(p>=q) return;
		i=p;
		j=q;
		M=m[i];//[p,i-1]<=M<=[j+1,q]

		while(1)
			{
				while(m[i]<M) i++;//[p,i-1]<=M<=[j+1,q]
				while(M<m[j]) j--;//[p,i-1]<=M<=[j+1,q]

				if(i>=j)// значит встретились(Можем либо вастретиться(Остановились на псевдомедиане), либо перескачить)
					{
						//[p,i-1]<=M<=[j+1,q]
						//i==j:   [p,i-1]<=M<=[j+1,q] => [p,j]<=M<=[j+1,q]
						//i==j+1: [p,j]<=M<=[j+1,q]
						QSort2_(m,p,j);
						QSort2_(m,j+1,q);
						return;
					}

				SWAP(m[i],m[j]);  //[p,i]<=M<=[j,q]
				i++;              //[p,i-1]<=M<=[j+1,q]
				j--;
			}
	}
//-------------------------------------------
void QSort2M(int *m, size_t n)
	{
		QSort2M_(m,0,n-1);
	}

void QSort2M_(int *m,size_t p,size_t q)
	{
		size_t i,j;
		int M;
		l:;
		if(p>=q) return;
		if(q-p>10) // Делаем только если длинна массива большая. Для маленького массива вызывать функцию rand просто жалко.
			{
				i=p+rand()%(q-p+1);
				SWAP(m[p],m[i]);
			}
		i=p;
		j=q;
		M=m[i];//[p,i-1]<=M<=[j+1,q]

		while(1)
			{
				while(m[i]<M) i++;//[p,i-1]<=M<=[j+1,q]
				while(M<m[j]) j--;//[p,i-1]<=M<=[j+1,q]

				if(i>=j)// значит встретились(Можем либо вастретиться(Остановились на псевдомедиане), либо перескачить)
					{
						//[p,i-1]<=M<=[j+1,q]
						//i==j:   [p,i-1]<=M<=[j+1,q] => [p,j]<=M<=[j+1,q]
						//i==j+1: [p,j]<=M<=[j+1,q]
						if(j-p<q-j) //Если длинна первого куска < длины второго куска то для него вызываем рекурсию.
							{
								QSort2M_(m,p,j);
								p=j+1;   //p и q переставляем на второй кусок (он от (j+1,q))
								q=q;
								goto l;
							}
						else
							{
								QSort2M_(m,j+1,q);
								p=p;     // p и q переставляем на первый кусок (он от (p,j))
								q=j;
								goto l;
							}
													
						return;
					}

				SWAP(m[i],m[j]);  //[p,i]<=M<=[j,q]
				i++;              //[p,i-1]<=M<=[j+1,q]
				j--;
			}
	}
//---------------------------------------------
#define V m[i]    //i текущий индекс.
#define iL (2*i+1)
#define iR (2*i+2)
#define L m[iL]   //Левый элемент
#define R m[iR]   //Правый Элемент

void Heapify(int *m, size_t n, size_t i)
	{
		while(iR<n)//Пока есть 3 элемента
			{
				if(V>=L && V>=R) return;
				if(L>R)
					{
						SWAP(V,L);
						i=iL;
					}
				else
					{
						SWAP(V,R);
						i=iR;
					}
			}

		if(iL<n)
			{
				if(L>V)
					{
						SWAP(V,L);
					}
			}
	}
void HeapSort(int *a, size_t n)
	{
		size_t i,l;
		for(i=n-2;i>0;i--) Heapify(a,n,i);
		Heapify(a,n,0);
		for(l=n-1;l>=1;l--)
			{
				SWAP(a[0],a[l]);
				Heapify(a,l,0);
			}			
	}
//-------------------------------------------
void CountSort(int *a, int *r, size_t n, int *b, int B) //В этой сортировке мы пользуемся тем, что rand даёт небольшой диапазон чисел
	{
		size_t i;
		int j;
		memset(b,0,sizeof(*b)*B);
		for(i=0;i<n;i++) b[a[i]]++;   // Берем младшую цифру.
		for(j=1;j<B;j++) b[j]+=b[j-1];
		for(i=n-1;i>0;i--)
			{
				r[b[a[i]]-1]=a[i];
				b[a[i]]--;
			}
		r[b[a[i]]-1]=a[i];
		b[a[i]]--;
	}
//-------------------------------------------
void DigitalSort(int *a_, int *r, size_t n, int *b, int B)
	{
		size_t i;
		int j;
		union IS //Integer Short
			{
				int i;
				unsigned short int s[2];
			}
		*a=(union IS*)a_; //a_ указатель на массив целых переменных.Заменяем этот указатель на указатель на объединение.Тогда каждый элемент этого массива можно интерпретировать как целую переменную, а можно как массив из двух short(Из 2 цифр. каждая занимает 16 бит.) 
		//В современных компьютерах размер int= размеру unsigned short int. Но на всякий случай проверяем.
		if(sizeof(int)!=sizeof(unsigned short)*2)
			{
				printf("sizeof(int)!=sizeof(unsigned short)*2");
				exit(-1);
			}

		memset(b,0,sizeof(*b)*B);
		for(i=0;i<n;i++) b[a[i].s[0]]++;// Берем младшую цифру.
		for(j=1;j<B;j++) b[j]+=b[j-1];
		for(i=n-1;i>0;i--)
			{
				r[b[a[i].s[0]]-1]=a[i].i;
				b[a[i].s[0]]--;
			}
		r[b[a[i].s[0]]-1]=a[i].i;
		b[a[i].s[0]]--;	

		memset(b,0,sizeof(*b)*B);
		memcpy(a,r,n*sizeof(*a));
		for(i=0;i<n;i++) b[a[i].s[1]]++;// Берем младшую цифру.
		for(j=1;j<B;j++) b[j]+=b[j-1];
		for(i=n-1;i>0;i--)
			{
				r[b[a[i].s[1]]-1]=a[i].i;
				b[a[i].s[1]]--;
			}
		r[b[a[i].s[1]]-1]=a[i].i;
		b[a[i].s[1]]--;	
	}
//-------------------------------------------      //блок для выделения памяти.
#define A(m0) {m0=(int*)malloc(n*sizeof(m0[0]));}  
#define MALLOC \
  A(m0)\
  A(m1)\
  A(m2)\
  A(m3)\
  A(t)\
  A(r)\

//-------------------------------------------Поиск Порядковой Статистики-----------------------------------
int FindStat2(int *m, size_t n, size_t k, int *t)//Статистика с индексом k,массива m, длины n,t временный массив (в нем и ищем статистику чтобы не ломать главный) 

	{
		memcpy(t,m,n*sizeof(*m));
		return FindStat2_(t,0,n-1,k);
	}

int FindStat2_(int *m,size_t p,size_t q, size_t k)
	{
		size_t i,j;
		int M;
		l:;
		if(p>=q) return m[p];
		if(q-p>10) // Делаем только если длинна массива большая. Для маленького массива вызывать функцию rand просто жалко.
			{
				i=p+rand()%(q-p+1);
				SWAP(m[p],m[i]);
			}
		i=p;
		j=q;
		M=m[i];//[p,i-1]<=M<=[j+1,q]

		while(1)
			{
				while(m[i]<M) i++;//[p,i-1]<=M<=[j+1,q]
				while(M<m[j]) j--;//[p,i-1]<=M<=[j+1,q]

				if(i>=j)// значит встретились(Можем либо вастретиться(Остановились на псевдомедиане), либо перескачить)
					{
						//[p,i-1]<=M<=[j+1,q]
						//i==j:   [p,i-1]<=M<=[j+1,q] => [p,j]<=M<=[j+1,q]
						//i==j+1: [p,j]<=M<=[j+1,q]
						if(j-p<q-j) //Если длинна первого куска < длины второго куска то для него вызываем рекурсию.
							{
								if (k<=j)
									{
										p=p;
										q=j;
										goto l;
									}
									//return FindStat2_(m,p,j,k);
								else
									{
										p=j+1;
										q=q;
										goto l;
									}
							}
						else
							{
								if(k>=j+1)
									{
										p=j+1;
										q=q;
										goto l;
									}
									//return FindStat2_(m,j+1,q,k)
								else
									{
										p=p;
										q=j;
										goto l;
									}
							}
													
						return 0;
					}

				SWAP(m[i],m[j]);  //[p,i]<=M<=[j,q]
				i++;              //[p,i-1]<=M<=[j+1,q]
				j--;
			}
	}
//----------------------------------------
int FindStat3(int *m, size_t n, size_t k, int *t)//Статистика с индексом k,массива m, длины n,t временный массив (в нем и ищем статистику чтобы не ломать главный) 

	{
		memcpy(t,m,n*sizeof(*m));
		return FindStat3_(t,0,n-1,k);
	}

int FindStat3_(int *m,size_t p,size_t q, size_t k)
	{
		size_t i,j;
		int M;
		l:;
		if(p>=q) return m[p];
		if(q-p>10) // Делаем только если длинна массива большая. Для маленького массива вызывать функцию rand просто жалко.
			{
			//	i=p+rand()%(q-p+1);
				int N5=0; //Начало куска с псевдомедианами
				int M5;
				for(i=p;i<=q;i+=5)
					{
						int n5=5;//Длинна куска
						if(q-i+1<5) n5=q-i+1; //Длинна последнего куска
						BubbleSort(m+i,n5);
						SWAP(m[p+N5],m[i+n5/2]);
						N5++;
					}

				M5=FindStat3_(m,p,p+N5-1,N5/2);//Медиана мадиан пятерок
				for(i=p;m[i]!=M5;i++);
				if(i>q)
					{
						printf("Error\n");
						exit(-1);
					}
				SWAP(m[p],m[i]);
				
			}
		i=p;
		j=q;
		M=m[i];//[p,i-1]<=M<=[j+1,q]

		while(1)
			{
				while(m[i]<M) i++;//[p,i-1]<=M<=[j+1,q]
				while(M<m[j]) j--;//[p,i-1]<=M<=[j+1,q]

				if(i>=j)// значит встретились(Можем либо вастретиться(Остановились на псевдомедиане), либо перескачить)
					{
						//[p,i-1]<=M<=[j+1,q]
						//i==j:   [p,i-1]<=M<=[j+1,q] => [p,j]<=M<=[j+1,q]
						//i==j+1: [p,j]<=M<=[j+1,q]
						if(j-p<q-j) //Если длинна первого куска < длины второго куска то для него вызываем рекурсию.
							{
								if (k<=j)
									{
										p=p;
										q=j;
										goto l;
									}
									//return FindStat2_(m,p,j,k);
								else
									{
										p=j+1;
										q=q;
										goto l;
									}
							}
						else
							{
								if(k>=j+1)
									{
										p=j+1;
										q=q;
										goto l;
									}
									//return FindStat2_(m,j+1,q,k)
								else
									{
										p=p;
										q=j;
										goto l;
									}
							}
													
						return 0;
					}

				SWAP(m[i],m[j]);  //[p,i]<=M<=[j,q]
				i++;              //[p,i-1]<=M<=[j+1,q]
				j--;
			}
	}


//----------------------------------------
  int FindStat1(int *m, size_t n,size_t k, int *t)
	{
		memcpy(t,m,n*sizeof(*m));
		QSort2M(t,n);
		return t[k];  // возвращаем значение статистики.
	}
//-----------------------------------------
//-------------------------------------------------------------------------------------------------------------------------------------
//-------------------------------------------------------------------------------------------------------------------------------------
//---------------------------------------------------БЛОК MAIN-----------------------------------------------------------------------------
//-------------------------------------------------------------------------------------------------------------------------------------
//-------------------------------------------------------------------------------------------------------------------------------------
int main(void)
	{
    	int *m0,*m1,*m2,*m3,*t,*r,*b,B=70000;//B=2147483647; // Предполагаем, что все числа не больше чем 70000.r-массив для результата.
		size_t n=N,i,j,k;
		int v,w;
		time_t t0,t1;
//		m0=(int*)malloc(n*sizeof(m0[0])); //Массив для исходных данных
//		m1=(int*)malloc(n*sizeof(m0[0])); //Скопируем исходные данные в m1 и будем его сортировать(т.к в этом файле будет много сортировок)
        MALLOC
//--------------------------------------Статистики----------------------------------------
		for(i=0;i<n;i++) m0[i]=i/2; //Создаем массив
		for(i=0;i<n;i++)
			{
				j=rand()%n;
				k=rand()%n;
				SWAP(m0[j],m0[k]);//Два случайных элемента меняем местами. 
			}
		for(i=0;i<n;i++)
			{
				v=FindStat1(m0,n,i,m1);
				w=FindStat3(m0,n,i,m1);//FindStat2(m0,n,i,m1);
				if(n<=50) printf("s[%d]=%d %d\n",(int)i,v,w);
				else if(v!=w) printf("Error %d %d\n",v,w);
			}
		printf("done");
//--------------------------------------Конец Статистик-----------------------------------

        printf("RAND_MAX=%d\n",RAND_MAX);
        b=(int*)malloc(B*sizeof(*b));
		for(i=0;i<n;i++) m0[i]=rand()%n;
		for(i=0;i<n;i++) m0[i]=(rand()|(rand()<<16));//Делаем так чтобы числа не огранчивались RAND_MAX
//		system("chcp 1251>nul");

//-----------------------------------
		if(n<60000)//Если n слишком большое не считать, т.к долго.
			{
				memcpy(m1,m0,n*sizeof(m0[0])); //Копирует (куда, откуда, сколько байт) это быстрее чем циклом.
				time(&t0);
				BubbleSort(m1,n);
				time(&t1);
				printf("dt BubbleSort=%d\n",(int)(t1-t0));
			
					for(i=1;i<n;i++)
						if(m1[i-1]>m1[i])
							printf("Error i=%d\n",(int)i);
			}
//----------------------------------------------------
			{
				memcpy(m2,m0,n*sizeof(m0[0])); //Копирует (куда, откуда, сколько байт) это быстрее чем циклом.
				time(&t0);
				Sort1(m2,n,t);
				time(&t1);
				printf("dt Sort1=%d\n",(int)(t1-t0));
			
			    if(n<60000)
			    	{
						for(i=0;i<n;i++)
							if(m1[i]!=m2[i])
								printf("Error1 i=%d\n",(int)i);
					}
			}
//------------------------------------------------------
			{
				memcpy(m3,m0,n*sizeof(m0[0])); //Копирует (куда, откуда, сколько байт) это быстрее чем циклом.
				time(&t0);
				Sort1OMP(m3,n,t);
				time(&t1);
				printf("dt Sort1OMP=%d\n",(int)(t1-t0));
			
			   
			    	{
						for(i=0;i<n;i++)
							if(m2[i]!=m3[i])
								printf("Error1OMP i=%d\n",(int)i);
					}
			}
//------------------------------------------------------
			{
				memcpy(m3,m0,n*sizeof(m0[0])); //Копирует (куда, откуда, сколько байт) это быстрее чем циклом.
				time(&t0);
				Sort2(m3,n,t);
				time(&t1);
				printf("dt Sort2=%d\n",(int)(t1-t0));
			
			   
			    	{
						for(i=0;i<n;i++)
							if(m2[i]!=m3[i])
								printf("Error2 i=%d\n",(int)i);
					}
			}
//----------------------------------------------------------
			{
				memcpy(m3,m0,n*sizeof(m0[0])); //Копирует (куда, откуда, сколько байт) это быстрее чем циклом.
				time(&t0);
				Sort2OMP(m3,n,t);
				time(&t1);
				printf("dt Sort2OMP=%d\n",(int)(t1-t0));
			    	
			   
		    		{
						for(i=0;i<n;i++)
							if(m2[i]!=m3[i])
								printf("Error2OMP i=%d\n",(int)i);
					}
			}
		
//--------------------------------------------------------
			{
				memcpy(m3,m0,n*sizeof(m0[0])); //Копирует (куда, откуда, сколько байт) это быстрее чем циклом.
				time(&t0);
				QSort1(m3,n);
				time(&t1);
				printf("dt QSort1=%d\n",(int)(t1-t0));
			
			   
			    	{
						for(i=0;i<n;i++)
							if(m2[i]!=m3[i])
								printf("ErrorQSort1 i=%d\n",(int)i);
					}
			}
//--------------------------------------------------
			{
				memcpy(m3,m0,n*sizeof(m0[0])); //Копирует (куда, откуда, сколько байт) это быстрее чем циклом.
				time(&t0);
				QSort2(m3,n);
				time(&t1);
				printf("dt QSort2=%d\n",(int)(t1-t0));
			
			   
			    	{
						for(i=0;i<n;i++)
							if(m2[i]!=m3[i])
								printf("ErrorQSort2 i=%d\n",(int)i);
					}
			}
//-------------------------------------------------
			{
				memcpy(m3,m0,n*sizeof(m0[0])); //Копирует (куда, откуда, сколько байт) это быстрее чем циклом.
				time(&t0);
				QSort2M(m3,n);
				time(&t1);
				printf("dt QSort2M=%d\n",(int)(t1-t0));
			
			   
			    	{
						for(i=0;i<n;i++)
							if(m2[i]!=m3[i])
								printf("ErrorQSort2M i=%d\n",(int)i);
					}
			}
//-------------------------------------------------
			if(N<6000)
				{
					{
						memcpy(m3,m0,n*sizeof(m0[0])); //Копирует (куда, откуда, сколько байт) это быстрее чем циклом.
						time(&t0);
						HeapSort(m3,n);
						time(&t1);
						printf("dt HeapSort=%d\n",(int)(t1-t0));
			
			   
			    			{
								for(i=0;i<n;i++) 
									if(m2[i]!=m3[i]) 
										printf("ErrorHeapSort i=%d\n",(int)i);
							}
					}
				}
//-------------------------------------------------
		    if(0)//Делаем так, чтобы этот код не выполнялся т.к долго.
		    	{
					{
						memcpy(m3,m0,n*sizeof(m0[0])); //Копирует (куда, откуда, сколько байт) это быстрее чем циклом.
						time(&t0);
						CountSort(m3,r,n,b,B);
						time(&t1);
						printf("dt CountSort=%d\n",(int)(t1-t0));
			
			   
					    	{
								for(i=0;i<n;i++)
									if(m2[i]!=r[i])
										printf("ErrorCountSort i=%d\n",(int)i);
							}
					}
				}
//--------------------------------------------------
#if 0   
            {
                        memcpy(m3,m0,n*sizeof(m0[0])); //Копирует (куда, откуда, сколько байт) это быстрее чем циклом.
                        time(&t0);
                        DigitalSort(m3,r,n,b,B);
                        time(&t1);
                        printf("dt DigitalSort=%d\n",(int)(t1-t0));
            
               
                            {
                                for(i=0;i<n;i++)
                                    if(m2[i]!=r[i])
                                        printf("ErrorDigitalSort i=%d\n",(int)i);
                            }
                    }   
#endif
//--------------------------------------------------  //блок для очистки памяти.
		#undef A//А к этому моменту уже определена. Разопредиляем А.
		#define A(m0) {free(m0);m0=NULL;}
		MALLOC
		free(b); b=NULL;
//		free(m0);	m0=NULL;
//		free(m1);	m1=NULL;
//-------------------------------------------------



		printf("DONE\n");
//		system("pause>nul");
		return 0;

	}                                        
